int[,] pic = new int[,] // не обязательно указывать кол-во строчек и столбцов если у вас есть фикс. данные 
{
{0,1,0,0,0,0,0,0,0,1,1,1,1,1,0,0,},
{0,1,1,0,0,0,0,0,0,1,0,0,0,1,0,0,},
{0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,},
{0,1,0,0,1,0,0,0,0,1,0,0,0,1,0,0,},
{0,1,0,0,0,1,1,1,1,0,0,0,0,1,1,0,},
{0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,},
{0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,},
{0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,},
{0,1,0,0,0,0,0,0,0,0,0,0,1,1,1,0,},
{0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,},
{0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,},
{0,1,0,0,0,0,1,1,1,1,1,0,1,1,1,0,},
{0,1,0,0,0,0,1,0,0,0,1,0,0,0,1,0,},
{0,1,0,0,0,0,1,0,0,0,1,0,0,0,1,0,},
{0,1,1,1,1,1,1,0,0,0,1,1,1,1,1,0,},
};

// далее опишем метод, который будет выводить нашу картинку 

void Print(int[,] picture)
{
    for (int i = 0; i < picture.GetLength(0); i++)
    {
        for (int j = 0; j < picture.GetLength(1); j++)
        {
            if (picture[i, j] == 0) Console.Write($" ");
            else Console.Write($"+");
        }
        Console.WriteLine();
    }
}
void Fill(int row, int col) // стобцы и строки по англ. 
{
    if (pic[row, col] == 0)// если в данной точке у нас 0 т.е не закрашен 
    {
        pic[row, col] = 1; //  0 то присваиваем 1, т.е закрашиваем единицей 
        Fill(row - 1, col); // далее на строку вверх,  Fill вызывает сам себя, поднялись вверрх если 0 краим 1 если нет то влево и т.д.
        Fill(row, col - 1);//  влево  
        Fill(row + 1, col);//  вниз
        Fill(row, col + 1);//  вправо
    }
}
Print(pic);
Console.WriteLine();
Fill(13, 13); // случайная точка для начала закрашивания 
Print(pic);
